<template>
  <div class="chanpinmingchen">
    <!-- info -->
    <div id="info" class="info_bg" style="padding-bottom: 50px;">
      <div class="container" style="background: none;">
        <div class="i-product">
          <div class="col-lg-8 col-md-8 col-sm-8 col-xs-12 i-product-content">
            <div class="i-p-left">
              <h3 class="info-t">{{name}}</h3>
              <div class="info_img_detail" style="text-align: center"> <img :src='img'
                  :alt="name" style="max-width:100%;"> </div>
              <div class="content_p"> <span class="sp"><small>详细说明：</small></span>
                <p>
                  整体衣柜看起来结构很简单，似乎就是几扇趟门把里面的柜子遮盖住，其实如今的入墙柜，仔细看的话，学问挺多</p>
                <p>
                  基本结构</p>
                <p>
                  1、如今市场上的整体衣柜，主要分为两类，一类是有门的，一类是开放的(无门)。开放式的入墙柜，将花花绿绿的美衣全部尽收眼底，很适合年轻人的家居氛围，如果再有心，可以就此为主体，围合成一个衣帽间。记者见到一款开放式入墙衣柜，美国进口，采用了铅白浅蓝色板材，典雅时尚，很美。</p>
                <p>
                  2、有门的整体衣柜，则在趟门上做起了美丽文章。市场上可供制作推拉门的材料有木板、玻璃、镜子及其他材料。木板朴实、自然，比较大众化，磨砂、布纹玻璃门则带来朦胧遮隐的效果，尤其在灯光映射下感觉甚为曼妙。镀银玻璃则有一种高档豪华气。透明的玻璃门显得晶莹剔透。此外还有百叶门，很新颖。</p>
                <p>
                  3、整体衣柜的内部构造也是颇有机关，柜身可为多种分柜，可根据室内空间大小及个人喜好，挑选若干分柜进行自由组合，一些活动层板、抽屉数量也可适当增减。另外，在有些入墙衣柜中还配有弹性拉伸设备，任意升级、简洁实用，体现出匠心独运的设计思想，所以在入墙衣柜中，哪里是抽屉，哪里是隔板，哪里放衣服，都会为您安排好，甚至毛巾、袜子、领带等，也能各就各位，一些入墙柜还设置有带滑轮的裤架，可以整齐地挂上十几条裤子，保持通风，不会皱褶，一目了然，而且拿取方便。</p>
                <p>
                  4、整体衣柜的制作过程不同于一般购置的板式家具，首先设计师会与用户有一个密切的接触与交流，了解用户的爱好及其家居风格，再上门测量，设计出合理的整体衣柜。这期间，设计师会提供电脑效果图，等用户满意后再根据图纸由流水线制作出整体衣柜。</p>
                <p>
                  流派发展</p>
                <p>
                  1、整体衣柜业在中国的发展机遇与前景:世界整体衣柜经过发展，逐渐形成了主要四大流派：法国体系的整体衣柜以注重浪漫艺术感为主；意大利体系注重设计风格；德国体系注重标准化；丹麦体系则以简洁著称。</p>
                <p>
                  2、整体衣柜进入中国家庭不过十年左右时间，中国整体衣柜行业形成一个产业的时间也并不长，随着中国百姓居家消费开始关注居家整体的生活艺术，人们喜欢在家居当中加入更多自主的创意与特色，卧室作为生活的核心，整体衣柜及步入式衣帽间越来越受到家庭的青睐。</p>
                <p>
                  3、整体衣柜的优点在于其将量身定做、机械化生产、节省空间、时尚美观大方有机结合，可以按照各人的需要进行设计，顶部空间也可以放被褥等物品。再通过衣柜推拉门色调的选择，做到整体衣柜与家居的一体化，衣柜与其他家具使用同一种材质和颜色的木材，使得整个居室的装修浑然一体。</p>
                <p>
                  时尚环保</p>
                 <p>
                   在以前的家庭装修中，主要是通过木工现场打制和购买成品。前者可量身订做，但品质不易控制，专业化不足；购买成品品质稳定，但无法与家居空间相匹配。而整体衣柜既吸收了二者的优点，又能搭配出各种不同尺寸和变化。再加上它是工厂化生产，安装简单快捷，省掉了手工制作的耗时耗力与麻烦，非常适合工作繁忙的年轻一族。
                 </p>
                <p>
                  节省空间</p>
                <p>
                  整体衣柜可以按照你的需要进行设计，顶部空间也可以放被褥、或者孩子玩腻的玩具。再通过衣柜推拉门色调的选择，实现和整个居室的装修浑然一体。如果你的卧室足够大的话，还可以用整体衣柜设计一个步入式衣帽间，外面设置一个颇具风格的推拉门，一个私有空间就这样制造完毕。</p>
                <p>
                  经济实用</p>
                <p>
                  整体衣柜在时下的流行，不仅因为它非常实用，而且因为合理运用空间，在经济上也有不少优势。它的造价是根据柜体的用材面积来计算价格的，不同的内部配置价格也有所不同。总面积乘以板材的每平米价格就是总价。</p>
                <p>
                  主要部件</p>
                <p>见光侧板：指柜体外框可见的竖向板件（被称为外侧板）。</p>
                <p>侧板：指柜体内部竖向板件</p>
                <p>中侧板：指立于顶底或者层板之间的竖向板件。</p>
                <p>固定层板：指柜体内部横向固定板件。</p>
                <p>活动层板：指柜体内部横向可上下调节板件。</p>
                <p>顶底板：用于与侧板连接的板件。</p>
                <p>脚线：用于柜子底部起支撑作用的板件。</p>
                <p>背板：嵌插于侧板与顶底板厚度为5mm或者9mm的板件。</p>
                <p>L架：在柜内呈倒“L”状安装，含1块L架侧板和1件固定层板。</p>
                <p>掩门：指用于遮盖柜体内部结构可开关的部件，用门铰安装门板，一般与柜身材料相同，四边封厚边。或用包覆材料封边框，中间插嵌百叶、饰面板、皮革或玻璃。</p>
                <p>假门：固定的不可活动的，仅起装饰或封闭作用的门板。</p>
                <p>收口板：指安装中用于填补柜身与墙壁间缝隙的板件。</p>
                <p>顶封板：用于柜子顶部与起装饰作用或填补天花间缝隙的板件，板厚18mm或者16mm。</p>
                <p>抽屉：可以沿柜体深度方向整体水平移动的部件，抽面，抽侧，抽后，抽底共五个部件组成。</p>
                <p>格仔架：可放置领带、内衣、裤袜等。由抽面、抽侧(带圆角)、抽后、抽底、9mm格子组成。</p>
                <p>裤架：可用于悬挂裤子。由抽面、抽侧(带圆角)、抽后、裤管组成。</p>
                <p>时尚抽：由抽面、抽底组成。</p>

              </div>
            </div>
          </div>
          <div class="col-lg-4 col-md-4 col-sm-4 hidden-xs">
            <div class="i-p-right">
              <div class="i-p-mesg"> <span>随时欢迎您与我们详细沟通</span> <img src="static/utils/img/p-mesg.jpg" alt="" class="img-responsive" />
               <router-link to='zixunzhongxin'>
                  <img src="/static/utils/img/mes.png" alt="" /><small>我要咨询+</small>
                </router-link>
              </div>
              <div class="i-p-case">
                <h2>产品中心</h2>
                <ul>
                  <li><img :src="img"/> </li>
                </ul>
                <router-link to='chanpinzhongxin'>
                  <img src="/static/utils/img/more.png" alt="" /><small>了解详情+</small>
                </router-link>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: '',

    mixins: [],

    components: {

    },

    props: {},

    data() {
      return {
        img:'',
        name:'',
      }
    },

    computed: {},

    watch: {},

    created() {
      let img = this.$route.query.img;
      let name = this.$route.query.name;
      this.img = img;
      this.name = name;
    },

    mounted() {},

    destroyed() {},

    methods: {
      handleClick: function(e) {
        console.log(e)

      },
    }
  };
</script>

<style lang="less">
</style>
